<%--
  Created by IntelliJ IDEA.
  User: pioneer
  Date: 2021/11/15
  Time: 20:25
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>专业简介-计算机科学与技术专业</title>
    <link rel="stylesheet" href="/2019210179/Public_CSS/sidebar.css" type="text/css">
</head>
<body>
<div class="container">
    <div class="header">
        <%@include file="/jsp/header.jsp"%>
    </div>
    <div class="navigation">
        <%@include file="/jsp/navigation.jsp"%>
    </div>
    <div class="context">
        <div class="title">
        </div>
        <div class="article">
            <div class="blank1">
                <h2>专业介绍</h2>
                <ul>
                    <li><a href="/2019210179/jsp/Professional_introduction/Professional_profile.jsp">专业简介</a></li>
                    <li><a href="/2019210179/jsp/Professional_introduction/Direction_profile.jsp">方向简介</a></li>
                </ul>
            </div>
            <div class="blank2">
                <h2>方向简介</h2>
                <p><strong>专业概况：</strong>
                    学院现有计算机科学与技术、软件工程、数据科学与大数据技术、人工智能、电子信息工程、通信工程6个本科专业，计算机科学与技术、软件工程、数据科学与大数据技术、人工智能4个专业按计算机类进行大类招生；电子信息工程、通信工程2个专业按电子信息类进行大类招生.<br>
                    <strong>一、计算机类</strong><br>

                    计算机类包括计算机科学与技术、软件工程、数据科学与大数据技术、人工智能4个本科专业，统一按“计算机类”进行大类招生、大类培养,第三学期根据学生意愿、专业规模和学习成绩进行专业分流，招收理科生，学制4年，优秀毕业生可免试推荐攻读硕士研究生。<br>

                    <strong>1.计算机科学与技术专业</strong><br>

                    专业概况：计算机科学与技术系始建于1988年的微机应用专业。1995年在原专业基础上建立了“计算机科学与技术系”。2000年申报成功了“计算机应用技术”硕士点。“十一五”期间计算机专业被批准为黑龙江省重点专业建设点和东北林业大学优势专业，2011年通过了省教育厅专家组对省重点专业的验收工作。同年又再次被批准为黑龙江省“十二五”重点专业建设点。2015年计算机科学与技术专业成为教育部专业综合改革试点专业。2019年评为黑龙江省一流专业建设点，2020年评为国家级一流本科专业建设点，2019年通过工程教育专业认证.<br>

                    培养目标：专业培养具有良好的道德与修养，遵守法律法规，具有社会和环境意识，掌握数学与自然科学基础知识以及与计算系统相关的基本理论、基本知识、基本技能和基本方法，具备包括计算思维在内的科学思维能力，设计计算解决方案、实现基于计算原理的系统的能力，能清晰表达，在团队中有效发挥作用，综合素质良好，能通过继续教育或其他的终身学习途径拓展自己的能力，了解和紧跟学科专业发展，在计算系统研究、开发、部署与应用等相关领域具有就业竞争力的高素质IT技术人才。<br>

                    核心课程：数字逻辑设计、计算机组成原理、数据结构与算法、操作系统、编译原理、软件工程、数据库系统、计算机网络、计算机系统结构等。<br>

                    特色优势：师资力量雄厚，近40%教师有国外留学经历，具备国际化视野培养学生能力。拥有完善的实验教学条件，拥有1个国家林业和草原局重点实验室，2个黑龙江省工程中心，校企共建实习基地2个；学生科研、竞赛氛围浓厚，近三年来学生参与的学科竞赛取得丰硕成果。
                    <br>
                    授予学位类别：学制四年，授工学学士学位。
                    <br>
                    专业咨询电话：0451-82191523。
                    <br>
                    <strong>2.数据科学与大数据技术专业</strong><br>
                    专业概况：“数据科学与大数据技术”专业于2020年3月获批，是国家一流本科专业“计算机科学与技术（大数据方向实验班）”的基础上继续深入建设的专业。数据科学与大数据技术专业以统计学、数学和计算机科学为基础，以“新工科”教育理念为指导，立足东北老工业基地，瞄准国家大数据战略需求和国际数据科学学术前沿，与生命科学、经济金融、智慧农业等领域深度融合，致力于培养掌握数据科学的理论与方法，精通大数据处理与分析、算法研发、可视化等技术的高水平人才。
                    <br>
                    培养目标：本专业培养适应国家建设发展需要，德、智、体全面发展，具有良好的科学素养和丰厚的人文底蕴，具备数学、统计学、计算机科学等多学科知识和技能，能够了解数据的获取、建模、管理、利用的全生命周期，熟知相关技术、系统和应用，具备数据分析和数据挖掘技能，能够综合运用所学知识解决与大数据相关的复杂工程技术问题，具有分析问题、解决问题、自主学习以及创新能力的复合型人才。毕业生适合在信息技术企业和企事业单位信息技术相关部门，从事大数据相关的采集、处理、分析、管理、挖掘等为主要内容的各层次工作。
                    <br>
                    特色优势：在人才培养模式方面，实施VIP（垂直整合项目）人才培养体系，将大一到大四的全部主要课程和集中实践环节纳入VIP体系，依据人才的认知和成长规律循序渐进地实施工程场景教学。在国际视野方面，发展国际合作办学,课程设置根据Microsoft和伯克利大学提出的数据科学体系设置。在工程实践方面，用全新的新工科体系进行实践环节设计，形成行业驱动的“一条主线、三个层次、四个平台”工程实践与创新能力培养体系。
                    <br>
                    授予学位类别：学制四年，授工学学士学位。
                    <br>
                    <br>
                    专业咨询电话：0451-82191525。
                    <br><br><br>
                    <strong>3.软件工程专业</strong><br>

                    专业概况：软件工程专业创办于2009年，2011年获得软件工程一级学科学术硕士学位授予权，2015年获得软件工程专业学位硕士授予权。2015年获教育部“卓越农（林）人才教育”项目建设，2016年获教育部“计算机类系统能力培养试验试点高校”项目建设。2017年开始计算机大类招生。
                    <br>
                    培养目标：专业面向软件产业需求，以立德树人为根本任务，培养德智体美劳全面发展的中国特色社会主义合格建设者和可靠接班人。培养具有扎实的软件工程理论基础、工程能力、良好综合素质和职业道德，具有创新、创业意识，竞争和团队精神，能适应软件工程新技术发展和社会需要，在软件工程领域从事软件研发、软件项目管理和软件运行维护等工作的应用研究型软件工程人才。
                    <br>
                    特色优势：建立了校企无缝连接的多元化“1.5+1.5+1”创新人才培养模式及学分置换机制，培养符合产业要求“零适应期”优秀学生。建立校企合作的实习、实训基地，通过工程认识、工程实践、项目管理、毕业实习等环节进行实习、实训。同时，以大学生创新、创业实践活动、科技大赛为补充，突出工程化、系统能力的培养。
                    <br>
                    授予学位类别：学制四年，授工学学士学位。
                    <br><br>
                    专业咨询电话：0451-82192243。
                    <br>
                    <strong>4.人工智能专业</strong><br>
                    专业概况：人工智能专业于2020年申报，经批准，2021年正式招生。根据国家人工智能发展战略和学校学科专业定位的总体规划，人工智能的专业定位为：立足省内、面向全国、放眼全球的全方位、多层次且具有行业特色的新工科示范性专业。本专业特点是融合计算机科学、数学、统计学、控制科学等多学科交叉形成的综合性学科。人工智能专业立足东北林业大学特色，借助信息与计算机工程学院多学科优势，以人工智能技术为纽带，重点突破多个学科间的交叉融合，探索培养具有创新实践和综合能力的新工科人才。
                    <br>
                    培养目标：本专业坚持党的教育方针和立德树人根本任务，围绕国家人工智能发展战略，以国家人工智能相关产业发展需求为导向，面向科学前沿、行业产业、学科创新和技术发展，培养具有坚定信念、家国情怀、社会主义核心价值观，具备计算机科学、数学、统计学、控制科学等多学科知识和技能，能够综合运用所学知识解决人工智能领域的复杂工程问题，具备社会责任感和生态意识，具备自主学习和创新能力，具备沟通与协作能力、团队精神、国际视野，能够适应人工智能的迅速发展，在人工智能及其交叉领域从事人工智能相关的基础理论研究、系统架构设计、应用技术开发、项目管理运维等工作的高水平工程型人才。
                    <br>
                    特色优势：人工智能专业以实践教学和科研参与型教学为基础，充分发挥产学研基地的作用，通过对实际项目的全程参与，培养学生的实际动手能力、创新能力和团队协作能力。立足东北林业大学林业行业特色，以人工智能技术为纽带，重点突破多个学科间的交叉融合，探索形成多学科交叉人才培养模式，培养新工科人才。
                    <br>
                    授予学位类别：学制四年，授工学学士学位。
                    <br>
                    专业咨询电话：0451-82192795。
                    <br><br><br>
                    <strong>二、电子信息类</strong><br>

                    电子信息类主要包括通信工程、电子信息工程2个专业，实行大类招生，第三学期根据学生意愿、专业规模和学习成绩进行专业分流。信息类招收理科生，学制4年，授予工学学士学位，优秀毕业生可免试推荐攻读硕士研究生。
                    <br>
                    <strong>1.电子信息工程专业</strong><br>
                    <br>
                    专业概况：电子信息工程专业面向“互联网+”、大数据和人工智能等新技术，培养具有扎实的信息处理、嵌入式系统设计和人工智能技术研发能力，毕业后能够成为电子信息领域设计、研发和管理的高级工程技术人才。
                    <br>
                    培养目标：具有良好的人文科学素养、社会责任感和职业道德；具有扎实的自然科学基础、电子信息专业基础和专业技能；具有工程实践和解决复杂工程问题的能力；具有管理团队及沟通交流的能力；能够成为从事与电子信息相关领域的科学研究、技术开发、工程设计和工程管理等工作的应用型技术人才和管理人才；能正确认识项目团队中的角色定位，能够组织制定工作计划并有效实施；能应对科技发展挑战，开展跨学科跨文化学习，掌握新的知识和技能，能够综合考虑各方面因素应用前沿技术提升产品质量、改善环境、促进可持续发展。
                    <br>
                    特色优势：师资力量雄厚，近80%教师具有博士学位，具备国际化视野培养学生能力。围绕物联网与人工智能技术，将信号处理算法软件与嵌入式系统硬件充分结合，形成了具有新工科特征的实践课程教学新体系，构建了功能完备的人工智能实验大平台，并与美国德州仪器（TI）公司和美国Altera公司联合共建了嵌入式系统开发实验室和信号处理实验室，为提升人才培养质量提供硬件支撑。
                    <br>
                    授予学位类别：学制四年，授工学学士学位。
                    <br><br>
                    专业咨询电话：0451-82192795。
                    <br><br><br>
                    <strong>2.通信工程专业</strong><br>

                    专业概况：东北林业大学通信工程专业建于2001年，经过多年的积淀，形成了“立足行业、多元融合、内涵培养、德行合一”的办学理念。2015年被批准为东北林业大学重点专业。2019年12月获得工程教育专业认证受理。
                    <br>
                    培养目标：专业面向国家社会和经济发展需求，培养具备坚定信念、家国情怀、社会主义核心价值观，德智体美劳全面发展的中国特色社会主义合格建设者和可靠接班人，培养具备应用数学、自然科学和通信工程专业相关知识继续学习、分析和解决移动通信系统和有线数据通信系统及相关关键技术中复杂工程问题能力，具备社会责任感和生态意识，具备沟通与协作能力、团队精神、创新意识和国际视野，能够从事通信工程专业特别是林业通信系统的研发、设计、制造、运维、管理工作的高水平工程型人才。
                    <br>
                    特色优势：专业与国内多家知名信息与通信技术（ICT）企业保持着长期合作关系，并联合建设了校内外实习实训基地，实现顶岗实习。专业重视创新能力与创新意识培养，在各类学科竞赛中取得突出成绩。近三年参与各级各类创新竞赛获奖人数达300余人次。
                    <br>
                    授予学位类别：学制四年，授工学学士学位。
                </p><br>
                <p>专业咨询电话：0451-82191523</p>
            </div>
            <div class="blank3"></div>
        </div>
    </div>

    <%@ include file="/jsp/footer.jsp"%>
</div>
</body>
</html>
